Revit 2027 API
AddInId.GetAddInName Method
 name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetAddInName()
Public Function GetAddInName As String
public:
String^ GetAddInName()
member GetAddInName : unit -> string
Return Value
String
 name of addin
See Also
Reference
AddInId Class
Autodesk.Revit.DB Namespace